danielealbano/bikenav-esp32/components/bmi160/bmi160_defs.h
/** FIFO DOWN selection */
/* Accel fifo down-sampling values*/
#define  BMI160_ACCEL_FIFO_DOWN_ZERO     UINT8_C(0x00)
#define  BMI160_ACCEL_FIFO_DOWN_ONE      UINT8_C(0x10)
#define  BMI160_ACCEL_FIFO_DOWN_TWO      UINT8_C(0x20)
#define  BMI160_ACCEL_FIFO_DOWN_THREE    UINT8_C(0x30)
#define  BMI160_ACCEL_FIFO_DOWN_FOUR     UINT8_C(0x40)
#define  BMI160_ACCEL_FIFO_DOWN_FIVE     UINT8_C(0x50)
#define  BMI160_ACCEL_FIFO_DOWN_SIX      UINT8_C(0x60)
#define  BMI160_ACCEL_FIFO_DOWN_SEVEN    UINT8_C(0x70)

/* Gyro fifo down-smapling values*/
#define  BMI160_GYRO_FIFO_DOWN_ZERO      UINT8_C(0x00)
#define  BMI160_GYRO_FIFO_DOWN_ONE       UINT8_C(0x01)
#define  BMI160_GYRO_FIFO_DOWN_TWO       UINT8_C(0x02)
#define  BMI160_GYRO_FIFO_DOWN_THREE     UINT8_C(0x03)
#define  BMI160_GYRO_FIFO_DOWN_FOUR      UINT8_C(0x04)
#define  BMI160_GYRO_FIFO_DOWN_FIVE      UINT8_C(0x05)
#define  BMI160_GYRO_FIFO_DOWN_SIX       UINT8_C(0x06)
#define  BMI160_GYRO_FIFO_DOWN_SEVEN     UINT8_C(0x07)

/* Accel Fifo filter enable*/
#define  BMI160_ACCEL_FIFO_FILT_EN       UINT8_C(0x80)

/* Gyro Fifo filter enable*/
#define  BMI160_GYRO_FIFO_FILT_EN        UINT8_C(0x08)

/** Definitions to check validity of FIFO frames */
#define FIFO_CONFIG_MSB_CHECK            UINT8_C(0x80)
#define FIFO_CONFIG_LSB_CHECK            UINT8_C(0x00)

/*! BMI160 accel FOC configurations */
#define BMI160_FOC_ACCEL_DISABLED        UINT8_C(0x00)
#define BMI160_FOC_ACCEL_POSITIVE_G      UINT8_C(0x01)
#define BMI160_FOC_ACCEL_NEGATIVE_G      UINT8_C(0x02)
#define BMI160_FOC_ACCEL_0G              UINT8_C(0x03)

/** Array Parameter DefinItions */
#define BMI160_SENSOR_TIME_LSB_BYTE      UINT8_C(0)
#define BMI160_SENSOR_TIME_XLSB_BYTE     UINT8_C(1)
#define BMI160_SENSOR_TIME_MSB_BYTE      UINT8_C(2)


/** Interface settings */
#define BMI160_SPI_INTF                  UINT8_C(1)
#define BMI160_I2C_INTF                  UINT8_C(0)
#define BMI160_SPI_RD_MASK               UINT8_C(0x80)
#define BMI160_SPI_WR_MASK               UINT8_C(0x7F)

/* Sensor & time select definition*/
#define BMI160_ACCEL_SEL		UINT8_C(0x01)
#define BMI160_GYRO_SEL			UINT8_C(0x02)
#define BMI160_TIME_SEL			UINT8_C(0x04)

/* Sensor select mask*/
#define BMI160_SEN_SEL_MASK		UINT8_C(0x07)

/* Error code mask */
#define BMI160_ERR_REG_MASK		UINT8_C(0x0F)

/* BMI160 I2C address */
#define BMI160_I2C_ADDR                 UINT8_C(0x68)

/* BMI160 secondary IF address */
#define BMI160_AUX_BMM150_I2C_ADDR		UINT8_C(0x10)

/** BMI160 Length definitions */
#define BMI160_ONE                       UINT8_C(1)
#define BMI160_TWO                       UINT8_C(2)
#define BMI160_THREE                     UINT8_C(3)
#define BMI160_FOUR                      UINT8_C(4)
#define BMI160_FIVE                      UINT8_C(5)

/** BMI160 fifo level Margin */
#define BMI160_FIFO_LEVEL_MARGIN         UINT8_C(16)

/** BMI160 fifo flush Command */
#define BMI160_FIFO_FLUSH_VALUE          UINT8_C(0xB0)

/** BMI160 offset values for xyz axes of accel */
#define BMI160_ACCEL_MIN_OFFSET         INT8_C(-128)
#define BMI160_ACCEL_MAX_OFFSET         INT8_C(127)

/** BMI160 offset values for xyz axes of gyro */
#define BMI160_GYRO_MIN_OFFSET         INT16_C(-512)
#define BMI160_GYRO_MAX_OFFSET         INT16_C(511)

/** BMI160 fifo full interrupt position and mask */
#define	BMI160_FIFO_FULL_INT_POS	UINT8_C(5)
#define	BMI160_FIFO_FULL_INT_MSK	UINT8_C(0x20)
#define	BMI160_FIFO_WTM_INT_POS		UINT8_C(6)
#define	BMI160_FIFO_WTM_INT_MSK		UINT8_C(0x40)

#define BMI160_FIFO_FULL_INT_PIN1_POS	UINT8_C(5)
#define	BMI160_FIFO_FULL_INT_PIN1_MSK	UINT8_C(0x20)
#define BMI160_FIFO_FULL_INT_PIN2_POS	UINT8_C(1)
#define	BMI160_FIFO_FULL_INT_PIN2_MSK	UINT8_C(0x02)

#define BMI160_FIFO_WTM_INT_PIN1_POS	UINT8_C(6)
#define	BMI160_FIFO_WTM_INT_PIN1_MSK	UINT8_C(0x40)
#define BMI160_FIFO_WTM_INT_PIN2_POS	UINT8_C(2)
#define	BMI160_FIFO_WTM_INT_PIN2_MSK	UINT8_C(0x04)

#define BMI160_MANUAL_MODE_EN_POS	UINT8_C(7)
#define BMI160_MANUAL_MODE_EN_MSK	UINT8_C(0x80)
#define BMI160_AUX_READ_BURST_POS	UINT8_C(0)
#define BMI160_AUX_READ_BURST_MSK	UINT8_C(0x03)

#define BMI160_GYRO_SELF_TEST_POS	UINT8_C(4)
#define BMI160_GYRO_SELF_TEST_MSK	UINT8_C(0x10)
#define BMI160_GYRO_SELF_TEST_STATUS_POS	UINT8_C(1)
#define BMI160_GYRO_SELF_TEST_STATUS_MSK	UINT8_C(0x02)

#define BMI160_GYRO_FOC_EN_POS	UINT8_C(6)
#define BMI160_GYRO_FOC_EN_MSK	UINT8_C(0x40)

#define BMI160_ACCEL_FOC_X_CONF_POS	UINT8_C(4)
#define BMI160_ACCEL_FOC_X_CONF_MSK	UINT8_C(0x30)

#define BMI160_ACCEL_FOC_Y_CONF_POS	UINT8_C(2)
#define BMI160_ACCEL_FOC_Y_CONF_MSK	UINT8_C(0x0C)

#define BMI160_ACCEL_FOC_Z_CONF_MSK	UINT8_C(0x03)

#define BMI160_FOC_STATUS_POS	UINT8_C(3)
#define BMI160_FOC_STATUS_MSK	UINT8_C(0x08)

#define BMI160_GYRO_OFFSET_X_MSK	UINT8_C(0x03)

#define BMI160_GYRO_OFFSET_Y_POS	UINT8_C(2)
#define BMI160_GYRO_OFFSET_Y_MSK	UINT8_C(0x0C)

#define BMI160_GYRO_OFFSET_Z_POS	UINT8_C(4)
#define BMI160_GYRO_OFFSET_Z_MSK	UINT8_C(0x30)

#define BMI160_GYRO_OFFSET_EN_POS	UINT8_C(7)
#define BMI160_GYRO_OFFSET_EN_MSK	UINT8_C(0x80)

#define BMI160_ACCEL_OFFSET_EN_POS	UINT8_C(6)
#define BMI160_ACCEL_OFFSET_EN_MSK	UINT8_C(0x40)

#define BMI160_GYRO_OFFSET_POS	        UINT16_C(8)
#define BMI160_GYRO_OFFSET_MSK	        UINT16_C(0x0300)

#define BMI160_NVM_UPDATE_POS	        UINT8_C(1)
#define BMI160_NVM_UPDATE_MSK	        UINT8_C(0x02)

#define BMI160_NVM_STATUS_POS	        UINT8_C(4)
#define BMI160_NVM_STATUS_MSK	        UINT8_C(0x10)

#define BMI160_MAG_POWER_MODE_MSK       UINT8_C(0x03)

#define BMI160_ACCEL_POWER_MODE_MSK     UINT8_C(0x30)
#define BMI160_ACCEL_POWER_MODE_POS     UINT8_C(4)

#define BMI160_GYRO_POWER_MODE_MSK      UINT8_C(0x0C)
#define BMI160_GYRO_POWER_MODE_POS      UINT8_C(2)


/* BIT SLICE GET AND SET FUNCTIONS */
#define	BMI160_GET_BITS(regvar, bitname)\
		((regvar & bitname##_MSK) >> bitname##_POS)
#define	BMI160_SET_BITS(regvar, bitname, val)\
		((regvar & ~bitname##_MSK) | \
		((val<<bitname##_POS)&bitname##_MSK))

#define BMI160_SET_BITS_POS_0(reg_data, bitname, data) \
				((reg_data & ~(bitname##_MSK)) | \
				(data & bitname##_MSK))

#define BMI160_GET_BITS_POS_0(reg_data, bitname)  (reg_data & (bitname##_MSK))

